public class Demo28 {
    public static void main(String[] args) {
        /*
        百钱买百鸡，有100元钱，要去买100只鸡，公鸡5元一只，母鸡3元一只，小鸡1元3只，问公，母，小鸡各买多少只。
        提示： a+b+c=100只
        5a+3b+1/3c=100钱
        a = 100/5
        b = 100/3
        c = 100/(1/3)
         */
        /**
         * 小鸡1块钱可以买3只，设小鸡从3开始计数，并假设要买100只，每次增长3
         * i=3,i<100,i=i+3
         */
        for (int i=3 ; i<100 ; i+=3){//小鸡
            for (int j=1 ; j<100 ; j++){//母鸡
                if (i/3 + j*3 + (100-i-j)*5 == 100 && 100-i-j>0){
                    System.out.println("小鸡" + i + "\t母鸡" + j + "\t公鸡" + (100-i-j));
                }
            }
        }

    }
}
